<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1">

    <title>KOMMA Documentation - Basic object triple mapping</title>

    <link href="../../assets/bootstrap/css/bootstrap_yeti-asciidoc.min.css" rel="stylesheet">
    <link href="../../assets/bootstrap/css/custom.css" rel="stylesheet">
    <link href="../../assets/highlightjs/github.min.css" rel="stylesheet">

	<style>
		body {
			padding-bottom: 50px;
		}

		.highlight {
			width: 100%;
		}

		#toctitle {
			display: none;
		}

		img {
			display: block;
			margin: auto; 
			margin-top: 50px;
			margin-bottom: 50px;
			max-width: 100%;
		}
	</style>

</head>

<body class="container">

	<div id="navigation">
		<img src="../../assets/logo.png" class="pull-right" />
		<div class="page-header" style="padding-top: 25px; margin-right: 150px;">
		  	<strong>

			  		<a href="../../index.html">&laquo; Back to Overview</a>

		  	</strong><br/>
		</div>
	</div>

	<div style="margin-top: 30px;"><h1>Basic object triple mapping</h1>
<div id="preamble">
<div class="sectionbody">
<div id="toc" class="toc2">
<div id="toctitle" class="title">Table of Contents</div>
<ul class="sectlevel1">
<li><a href="#_introduction">1. Introduction</a></li>
<li><a href="#_prepare_the_model">2. Prepare the model</a></li>
<li>
<ul class="sectlevel2">
<li><a href="#_library">2.1. Library</a></li>
<li><a href="#_person">2.2. Person</a></li>
<li><a href="#_document">2.3. Document</a></li>
<li><a href="#_book">2.4. Book</a></li>
<li><a href="#_magazine">2.5. Magazine</a></li>
</ul>
</li>
<li><a href="#_generating_and_querying_some_data_main_java">3. Generating and querying some data (Main.java)</a></li>
</ul>
</div>

</div>
</div>
<div class="sect1">
<h2 id="_introduction">1. Introduction</h2>
<div class="sectionbody">
<div class="paragraph">
<p>KOMMA allows the mapping of RDF classes to Java interfaces. We outline this mapping in
this tutorial. The full source code of this tutorial is available in the <a href="https://github.com/komma/komma-examples">KOMMA examples
repository on Github</a>.</p>
</div>
<div class="paragraph">
<p>This tutorial assumes that you have installed KOMMA using the Eclipse Market Place or a specific update site. Alternatively
you pulled the sources or downloaded the binaries and somehow imported them into Eclipse.</p>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_prepare_the_model">2. Prepare the model</h2>
<div class="sectionbody">
<div class="paragraph">
<p>We take the use case of a library. A library database stores a number of various documents such as
books or magazines. We therefore get the following entities and respective attributes given
within parentheses.</p>
</div>
<div class="ulist">
<ul>
<li>
<p>Person (name, dateOfBirth, placeOfBirth)</p>
</li>
<li>
<p>Document (dateOfRelease, title)</p>
<div class="ulist">
<ul>
<li>
<p>Book (authors)</p>
</li>
<li>
<p>Magazine ()</p>
</li>
</ul>
</div>
</li>
</ul>
</div>
<div class="paragraph">
<p>Please note that in this tutorial <em>Book</em> and <em>Magazine</em> inherit from the <em>Document</em> entity.
For the sake of simplicity the <em>Magazines</em> do not have any special attributes in this tutorial,
except for the ones inherited from the Document entity.</p>
</div>
<div class="paragraph">
<p>Let us now have a look at the java interfaces that we use to create our entities.</p>
</div>
<div class="sect2">
<h3 id="_library">2.1. Library</h3>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="java language-java">package net.enilink.komma.example.objectmapping.model;

import net.enilink.komma.core.URI;
import net.enilink.komma.core.URIs;

public class Library {

	public static final String NS = "http://enilink.net/examples/objectmapping#";

	public static final URI NS_URI = URIs.createURI(NS);

}</code></pre>
</div>
</div>
<div class="paragraph">
<p>The <em>Library</em> class basically contains some static fields for easier working with URIs.</p>
</div>
</div>
<div class="sect2">
<h3 id="_person">2.2. Person</h3>
<div class="paragraph">
<p>We furthermore define the <em>Person</em> entity as a Java interface with properties such
as <em>dateOfBirth</em> or <em>name</em>. The properties are mapped with the provided <em>@Iri</em> annotation
on the getter method for each property. Please note that we are using JavaBeans-like
getters and setters, i.e. functions are named set{property} or get{property} respectively.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="java language-java">package net.enilink.komma.example.objectmapping.model;

import javax.xml.datatype.XMLGregorianCalendar;

import net.enilink.composition.annotations.Iri;

@Iri(Library.NS + "Person")
public interface Person {

	@Iri(Library.NS + "name")
	String getName();

	void setName(String name);

	@Iri(Library.NS + "dateOfBirth")
	XMLGregorianCalendar getDateOfBirth();

	void setDateOfBirth(XMLGregorianCalendar dateOfBirth);

	@Iri(Library.NS + "placeOfBirth")
	String getPlaceOfBirth();

	void setPlaceOfBirth(String placeOfBirth);

}</code></pre>
</div>
</div>
<div class="paragraph">
<p>Please note that KOMMA can work with <em>XMLGregorianCalendar</em> for date bindings.</p>
</div>
</div>
<div class="sect2">
<h3 id="_document">2.3. Document</h3>
<div class="paragraph">
<p>Documents, too, can be defined as a java interface. In this case we are using a more
RDF-like convention to name our setters and getters. The set and get prefixes are gone.
Setters and Getters are distinguished by the parameter list in the respective method
signature. Please also note that our setters do have a return type, namely the
type of the document interface. Thus these setters allow for method chaining when
setting properties.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="java language-java">package net.enilink.komma.example.objectmapping.model;

import javax.xml.datatype.XMLGregorianCalendar;

import net.enilink.composition.annotations.Iri;

@Iri(Library.NS + "Document")
public interface Document {

	@Iri(Library.NS + "dateOfRelease")
	XMLGregorianCalendar dateOfRelease();

	Document dateOfRelease(XMLGregorianCalendar dateOfRelease);

	@Iri(Library.NS + "title")
	String title();

	Document title(String title);

}</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_book">2.4. Book</h3>
<div class="paragraph">
<p>Last but not least we define the <em>Book</em> entity.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="java language-java">package net.enilink.komma.example.objectmapping.model;

import java.util.Set;

import net.enilink.composition.annotations.Iri;

@Iri(Library.NS + "Book")
public interface Book extends Document {

	@Iri(Library.NS + "author")
	Set&lt;Person&gt; authors();

	Document authors(Set&lt;Person&gt; persons);

}</code></pre>
</div>
</div>
</div>
<div class="sect2">
<h3 id="_magazine">2.5. Magazine</h3>
<div class="paragraph">
<p>Magazines inherit their properties from the <em>Document</em> entity definition.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="java language-java">package net.enilink.komma.example.objectmapping.model;

import net.enilink.composition.annotations.Iri;

@Iri(Library.NS + "Magazine")
public interface Magazine extends Document {

	/*
	 * Some magazine specific attributes
	 */

}</code></pre>
</div>
</div>
</div>
</div>
</div>
<div class="sect1">
<h2 id="_generating_and_querying_some_data_main_java">3. Generating and querying some data (Main.java)</h2>
<div class="sectionbody">
<div class="paragraph">
<p>In this example, we create one book and add Clint Eastwood and Marty McFly as authors
to this book and execute some queries against the database.</p>
</div>
<div class="paragraph">
<p>In this section we essentially provide a copy of the <em>Main.java</em> file. Please have
a look at the comments within this file.</p>
</div>
<div class="listingblock">
<div class="content">
<pre class="highlight"><code class="java language-java">package net.enilink.komma.example.objectmapping;

import java.util.Date;
import java.util.GregorianCalendar;

import javax.xml.datatype.DatatypeConfigurationException;
import javax.xml.datatype.DatatypeFactory;
import javax.xml.datatype.XMLGregorianCalendar;

import net.enilink.komma.core.IBindings;
import net.enilink.komma.core.IEntityManager;
import net.enilink.komma.core.IEntityManagerFactory;
import net.enilink.komma.core.IQuery;
import net.enilink.komma.core.KommaModule;
import net.enilink.komma.em.util.ISparqlConstants;
import net.enilink.komma.example.objectmapping.model.Book;
import net.enilink.komma.example.objectmapping.model.Library;
import net.enilink.komma.example.objectmapping.model.Person;
import net.enilink.komma.example.objectmapping.util.ExampleModule;

import org.openrdf.repository.RepositoryException;
import org.openrdf.repository.sail.SailRepository;
import org.openrdf.sail.memory.MemoryStore;

import com.google.inject.Guice;
import com.google.inject.Injector;

public class Main {

	public static void main(String[] args)
			throws DatatypeConfigurationException, RepositoryException {

		// Amongst others, access to data can be managed with KOMMA by
		// implementations of IEntityManager. In this tutorial we create an
		// EntityManager on top of Sesame's MemoryStore.
		//
		// We have to tell this manager to use the Book and Person interfaces to
		// encapsulate access to instances and properties of Books or Persons.
		// We have to register them as Concepts.

		SailRepository dataRepository = new SailRepository(new MemoryStore());
		dataRepository.initialize();
		IEntityManager manager = createEntityManager(new ExampleModule(
				dataRepository, new KommaModule() {
					{
						addConcept(Book.class);
						addConcept(Person.class);
					}
				}));

		// Create a book and add some authors
		Book book = manager.createNamed(Library.NS_URI.appendFragment("book1"),
				Book.class);
		// Set properties using method chaining
		book.title("Point of No Return").dateOfRelease(getCurrentTime());

		book.authors().add(
				createPerson(manager, "person1", "Clint Eastwood", new Date()));
		book.authors().add(
				createPerson(manager, "person2", "Marty McFly", new Date()));

		// This results in the following RDF statements
		// @Prefix om: &lt;http://enilink.net/examples/objectmapping#&gt;
		// om:book1 rdf:type om:Book
		// om:book1 rdf:type om:Document
		// om:book1 om:dateOfRelease "..."^^xsd:datetime
		// om:book1 om:title "Point of No Return"
		// om:person1 rdf:type om:Person
		// om:person1 om:name "Clint Eastwood"
		// om:person1 om:dateOfBirth "..."
		// om:book1 om:author person1
		// om:person2 rdf:type om:Person
		// om:person2 om:name "Marty McFly"
		// om:person2 om:dateOfBirth "..."
		// om:book1 om:author person2
		//
		// Please note that KOMMA is able to handle sets, as shown by the
		// representation of authors. Sets are represented as repeated
		// properties, i.e. they are represented by multiple
		// statements in the form of (book, author, person)

		// Do some queries!
		exampleRawQuery(manager);
		System.out.println(".........");
		exampleMappedQuery(manager);
		System.out.println(".........");
		exampleRemoveObjectAndQuery(manager, book);
		System.out.println(".........");

		System.out.println("Done!");
	}

	private static IEntityManager createEntityManager(ExampleModule module) {
		Injector injector = Guice.createInjector(module);
		IEntityManagerFactory factory = injector
				.getInstance(IEntityManagerFactory.class);
		IEntityManager manager = factory.get();
		return manager;
	}

	private static Person createPerson(IEntityManager manager, String id,
			String name, Date date) {
		XMLGregorianCalendar cal = getCurrentTime();
		Person person = manager.createNamed(Library.NS_URI.appendFragment(id),
				Person.class);
		person.setName(name);
		person.setDateOfBirth(cal);
		// This will result in the following RDF statements

		// person rdf:type &lt;http://enilink.net/examples/objectmapping#Person&gt;
		// person &lt;http://enilink.net/examples/objectmapping#name&gt; "..."
		// person &lt;http://enilink.net/examples/objectmapping#dateOfBirth&gt; "..."
		return person;
	}

	private static void exampleRawQuery(IEntityManager manager) {
		// We now can query the EntityManager for some data using SPARQL.

		System.out.println("Do a raw query:");
		IQuery&lt;?&gt; query = manager.createQuery( //
				"PREFIX om: &lt;" + Library.NS + "&gt;" //
						+ "SELECT ?title ?author ?authorDateOfBirth WHERE { " //
						+ "?book om:title ?title . " //
						+ "?book om:author ?person . " //
						+ "?person om:name ?authorName . " //
						+ "?person om:dateOfBirth ?authorDateOfBirth " //
						+ "}");

		// Expected output:
		// LinkedHashBindings: {title=Point of No Return, author=..., ...}
		// LinkedHashBindings: {title=Point of No Return, author=..., ...}

		for (IBindings&lt;?&gt; bindings : query.evaluate(IBindings.class)) {
			System.out.println(bindings);
		}
	}

	private static void exampleMappedQuery(IEntityManager manager) {

		// Besides querying data with SPARQL, we can also use our model
		// interfaces for encapsulating data access to properties. In this
		// function we simply select all instances of Person and print the
		// properties defined by the respective interface.

		System.out.println("Do a mapped query:");
		IQuery&lt;?&gt; query = manager
				.createQuery(
						ISparqlConstants.PREFIX
								+ "SELECT ?person ?clazz WHERE {?person rdf:type ?clazz}")
				.setParameter("clazz", Library.NS_URI.appendLocalPart("Person"));

		// Expected output:
		// Name: Clint Eastwood
		// Place of birth:null
		// Name: Marty McFly
		// Place of birth:null

		for (IBindings&lt;?&gt; bindings : query.evaluate(IBindings.class)) {
			Person person = (Person) bindings.get("person");
			System.out.println("Name: " + person.getName());
			System.out.println("Place of birth:" + person.getPlaceOfBirth());
		}

		// Please note, because of the fact that we did not set any place of
		// birth. The respective getter returns null.
	}

	private static void exampleRemoveObjectAndQuery(IEntityManager manager,
			Book book) {

		// We delete the book and show that it is really gone.

		System.out.println("Select all books");

		IQuery&lt;?&gt; query = manager.createQuery(
				ISparqlConstants.PREFIX
						+ "SELECT ?book WHERE { ?book rdf:type ?clazz .  }")
				.setParameter("clazz", Library.NS_URI.appendLocalPart("Book"));

		for (IBindings&lt;?&gt; bindings : query.evaluate(IBindings.class)) {
			System.out.println(bindings.get("book"));
		}
		manager.remove(book);

		System.out.println("Select all books ... again!");
		query = manager.createQuery(
				ISparqlConstants.PREFIX
						+ "SELECT ?book WHERE { ?book rdf:type ?clazz .  }")
				.setParameter("clazz", Library.NS_URI.appendLocalPart("Book"));

		// Expected output:
		// Select all books
		// http://enilink.net/examples/objectmapping#book1
		// Select all books ... again!

		for (IBindings&lt;?&gt; bindings : query.evaluate(IBindings.class)) {
			System.out.println(bindings.get("book"));
		}
	}

	private static XMLGregorianCalendar getCurrentTime() {
		GregorianCalendar c = new GregorianCalendar();
		c.setTime(new Date());
		XMLGregorianCalendar cal = null;
		try {
			cal = DatatypeFactory.newInstance().newXMLGregorianCalendar(c);
		} catch (DatatypeConfigurationException e) {
			throw new RuntimeException(e);
		}
		return cal;
	}

}</code></pre>
</div>
</div>
</div>
</div></div>
	<script src="../../assets/highlightjs/highlight.min.js"></script>
	<script>hljs.initHighlightingOnLoad();</script>
	<script>
		(function(i, s, o, g, r, a, m) {
			i['GoogleAnalyticsObject'] = r;
			i[r] = i[r] || function() {
				(i[r].q = i[r].q || []).push(arguments)
			}, i[r].l = 1 * new Date();
			a = s.createElement(o), m = s.getElementsByTagName(o)[0];
			a.async = 1;
			a.src = g;
			m.parentNode.insertBefore(a, m)
		})(window, document, 'script',
				'//www.google-analytics.com/analytics.js', 'ga');

		ga('create', 'UA-49874284-1', 'enilink.net');
		ga('send', 'pageview');
	</script>
</body>

</html>